allergen2/app/views/recipes/_recipe_form.html.erb

SELECT "users".* FROM "users"
SELECT "ingredients".* FROM "ingredients"
---
<%= f.text_field :name %>
<%= f.collection_select :user_id, User.all, :id, :name, {prompt: "Choose a user"}%>
<%= f.collection_check_boxes(:ingredient_ids, Ingredient.all, :id, :name) do |b| %>