allergen2/app/views/recipes/index.html.erb

<% @recipes.each do |r| %>
    <li><%= link_to r.name, recipe_path(r) %>     Ingredients: <%=r.ingredients.count %></li>
---
SELECT COUNT(*) FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 7]]