allergen2/app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 6]]
---
<h4> Here are the ingredients. </h4>
<% @recipe.ingredients.each do |ing| %>