allergen2/app/views/ingredients/show.html.erb


<p>There are <%= @ingredient.users.count %> users allergic to me. </p>
---
SELECT COUNT(*) FROM "users" INNER JOIN "user_ingredients" ON "users"."id" = "user_ingredients"."user_id" WHERE "user_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]

<ol>
<% @ingredient.recipes.each do |r| %>
---
SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]