allergen2/app/views/users/_user_form.html.erb

SELECT "ingredients".* FROM "ingredients"
---
    <br>
    <%= f.collection_check_boxes(:ingredient_ids, Ingredient.all, :id, :name) do |b| %>