allergen2/app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
---
<ol>
    <% @user.recipes.each do |r| %>

SELECT "ingredients".* FROM "ingredients" INNER JOIN "user_ingredients" ON "ingredients"."id" = "user_ingredients"."ingredient_id" WHERE "user_ingredients"."user_id" = ?  [["user_id", 3]]
---
<!--- Put in iterable later to render allergies -->
<% @user.ingredients.each do |ing|%>