allergen2/app/controllers/ingredients_controller.rb

    def index
        @ingredients = Ingredient.all.sort {|a, b| b.users.length <=> a.users.length}
---
SELECT "ingredients".* FROM "ingredients"
SELECT "users".* FROM "users" INNER JOIN "user_ingredients" ON "users"."id" = "user_ingredients"."user_id" WHERE "user_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "user_ingredients" ON "users"."id" = "user_ingredients"."user_id" WHERE "user_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]

    def create
        ing = Ingredient.create(ingredient_params(:name))
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Peanut"], ["created_at", "2020-05-20 20:01:37.272278"], ["updated_at", "2020-05-20 20:01:37.272278"]]

    def ingredient_instance
        @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]