allergen2/app/controllers/recipes_controller.rb

SELECT COUNT(*) FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
    def index
        @recipes = Recipe.all.sort {|a, b| b.ingredients.count <=> a.ingredients.count}

INSERT INTO "recipes" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "PBJ"], ["user_id", 1], ["created_at", "2020-05-20 20:55:26.891844"], ["updated_at", "2020-05-20 20:55:26.891844"]]
INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["recipe_id", 5], ["ingredient_id", 4], ["created_at", "2020-05-20 20:55:27.018554"], ["updated_at", "2020-05-20 20:55:27.018554"]]
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ? AND "recipe_ingredients"."ingredient_id" = ? LIMIT ?  [["recipe_id", 5], ["ingredient_id", 4], ["LIMIT", 1]]
---
    def create
        @recipe = Recipe.new(recipe_params(:name, :user_id))
        if @recipe.valid?
            @recipe.save
            params[:recipe][:ingredient_ids].each do |ing|
            unless ing.empty?
                RecipeIngredient.find_or_create_by(recipe_id: @recipe.id, ingredient_id: ing)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def recipe_instance
        @recipe = Recipe.find(params[:id])