allergen2/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Enrique Pittaluga"], ["created_at", "2020-05-20 20:30:43.746865"], ["updated_at", "2020-05-20 20:30:43.746865"]]
INSERT INTO "user_ingredients" ("user_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["ingredient_id", 3], ["created_at", "2020-05-20 20:30:43.779700"], ["updated_at", "2020-05-20 20:30:43.779700"]]
SELECT "user_ingredients".* FROM "user_ingredients" WHERE "user_ingredients"."user_id" = ? AND "user_ingredients"."ingredient_id" = ? LIMIT ?  [["user_id", 5], ["ingredient_id", 3], ["LIMIT", 1]]
---
    def create
        @user = User.new(user_params(:name))
        if @user.valid?
            @user.save
            params[:user][:ingredient_ids].each do |ing|
                if !ing.empty?
                    UserIngredient.find_or_create_by(user_id: @user.id, ingredient_id: ing)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
DELETE FROM "user_ingredients" WHERE "user_ingredients"."id" = ?  [["id", 17]]
SELECT "user_ingredients".* FROM "user_ingredients" WHERE (user_id = '6')
INSERT INTO "user_ingredients" ("user_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["ingredient_id", 4], ["created_at", "2020-05-20 20:45:22.863168"], ["updated_at", "2020-05-20 20:45:22.863168"]]
SELECT "user_ingredients".* FROM "user_ingredients" WHERE "user_ingredients"."user_id" = ? AND "user_ingredients"."ingredient_id" = ? LIMIT ?  [["user_id", 6], ["ingredient_id", 4], ["LIMIT", 1]]
---
    def update
        @user.update(user_params(:name))
        UserIngredient.where("user_id = ?", params[:id]).destroy_all
        params[:user][:ingredient_ids].each do |ing|
            if !ing.empty?
                UserIngredient.find_or_create_by(user_id: @user.id, ingredient_id: ing)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def user_instance
        @user = User.find(params[:id])